public class Main {
    public static void main(String[] args) {

      int ticket = 1000;   // Объявляете переменные для входных данных и
      int OneBonusMille = 20;  // параметров программы: одну для хранения

        System.out.println("Получите бонусных миль:");  // стоимости билета, другую для хранения количества
        System.out.println((ticket / OneBonusMille) + " миль. ");// рублей для одной бонусной милли

        // Рассчитываете количество бонусных милль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}